# -*- coding: utf-8 -*-
# 请编写move(n, a, b, c)函数，它接收参数n，表示3个柱子A、B、C中第1个柱子A的盘子数量，然后打印出把所有盘子从A借助B移动到C的方法，例如：

def move(n, a, b, c):
    if n == 1:
        print(a, '-->', c)
    else:
        move(n - 1, a, c, b)
        move(1, a, b, c)
        move(n - 1, b, a, c)


# 期待输出:
# A --> C
# A --> B
# C --> B
# A --> C
# B --> A
# B --> C
# A --> C
move(3, 'A', 'B', 'C')


# 靠,没仔细看理解错了,我以为ABC是汉诺塔的那个块 难怪

# 由于这个例子是可以直接跨柱子移动的.
# 汉诺塔递归需要注意几个点,以2个为例子
# A起点 B缓冲 C终点

# 1层:
    # 1层到终点 A->C

# 2层:

    # 1层到缓冲 A->B

    # 2层到终点 A->C

    # 1层到终点 B->C

# 3层:把第3层移动到C,然后就跟2层一样

    # 1层到终点 A->C
    # 2层到缓冲 A->B
    # 1层到缓冲 C->B
    # 3层到终点 A->C
        # 现在的缓冲相当于编程了A

